Tekla Open API Reference for Tekla Structures 2025
DimensionTextAttributes Properties
The DimensionSetBaseAttributes.DimensionTextAttributes type exposes the following members.
Properties
Name | Description
Font
 The font attributes.
Frame
 The frame type of the dimension value text.
TextPlacing
 The place of the dimension value text.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
Tekla.Structures.Drawing Namespace